// Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

Console.Write("Введите количество элементов: ");
int size = Convert.ToInt32(Console.ReadLine());
int [] array = new int [size];
int count = 0;

for (int i=0; i<size; i++)
{
    array[i]= new Random().Next (100,1000);
    count++;
}
Console.Write("[{0}]",string.Join(", ",array));
Console.Write(" -> "+ count);


//--------------------------------------------------------------------------
// Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19

// [-4, -6, 89, 6] -> 0


//--------------------------------------------------------------------------------
// Задача 38: Задайте массив вещественных чисел. Найдите разницу между максимальным и минимальным элементов массива.

// [3 7 22 2 78] -> 76